In [421]:
import pandas as pd
import numpy as np

# Exercise 1:

You have a DataFrame with the columns ["age", "salary"] as strings.

- Convert these columns to the appropriate numeric type.

In [422]:
data = {
  'age': ['30', '50', '25', '40', '35', '45', '28', '55', '32', '38'],
  'salary': ['1500', '7000', '1200', '5000', '3000', '6000', '1800', '8000', '2500', '4500'],
  'sectors': [np.nan, 'rh', 'ti', 'ml', 'ia', 'dp', ['financeiro', 'dp'], ['eng', 'limpeza'], 'psico', 'limpeza'],
}

df = pd.DataFrame(data)

In [423]:
df['age'] = df['age'].astype(np.int8)
df['salary'] = df['salary'].astype(np.int16)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      10 non-null     int8
 1   salary   10 non-null     int16
 2   sectors  9 non-null      object
dtypes: int16(1), int8(1), object(1)
memory usage: 242.0+ bytes

# Exercise 2

The column `birth_data` is in string format (object).
- Convert this column to datetime type.

In [424]:
# Inserindo uma coluna nova na posição 2 do dataframe

df.insert(loc=2, column='birth_data', value="1999-01-19")

In [425]:
df['birth_data'] = pd.to_datetime(df['birth_data'])

df.info()

# df['birth_data'].dt.year
# df['birth_data'].dt.month_name()
# df['birth_data'].dt.day_name()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         10 non-null     int8
 1   salary      10 non-null     int16
 2   birth_data  10 non-null     datetime64[ns]
 3   sectors     9 non-null      object
dtypes: datetime64[ns](1), int16(1), int8(1), object(1)
memory usage: 322.0+ bytes

# Exercise 3

- Convert all columns in the DataFrame that contain boolean values (True/False) to integers (0/1).

In [426]:
df.insert(loc=3, column='have_job', value=True)

In [427]:
df['have_job'] = df['have_job'].astype(np.int8)
df

   age  salary birth_data  have_job           sectors
0   30    1500 1999-01-19         1               NaN
1   50    7000 1999-01-19         1                rh
2   25    1200 1999-01-19         1                ti
3   40    5000 1999-01-19         1                ml
4   35    3000 1999-01-19         1                ia
5   45    6000 1999-01-19         1                dp
6   28    1800 1999-01-19         1  [financeiro, dp]
7   55    8000 1999-01-19         1    [eng, limpeza]
8   32    2500 1999-01-19         1             psico
9   38    4500 1999-01-19         1           limpeza

In [428]:
df.loc[df['age'] == 30, ['have_job']] = 0

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         10 non-null     int8
 1   salary      10 non-null     int16
 2   birth_data  10 non-null     datetime64[ns]
 3   have_job    10 non-null     int8
 4   sectors     9 non-null      object
dtypes: datetime64[ns](1), int16(1), int8(2), object(1)
memory usage: 332.0+ bytes

# Exercise 4

- You have a column `setores` that contains lists of strings.

Convert this column so each value becomes a single string with items separated by commas.

In [429]:
df

   age  salary birth_data  have_job           sectors
0   30    1500 1999-01-19         0               NaN
1   50    7000 1999-01-19         1                rh
2   25    1200 1999-01-19         1                ti
3   40    5000 1999-01-19         1                ml
4   35    3000 1999-01-19         1                ia
5   45    6000 1999-01-19         1                dp
6   28    1800 1999-01-19         1  [financeiro, dp]
7   55    8000 1999-01-19         1    [eng, limpeza]
8   32    2500 1999-01-19         1             psico
9   38    4500 1999-01-19         1           limpeza

In [430]:

df = df.explode('sectors')
df.reset_index(drop=True, inplace=True)

df['sectors'] = df['sectors'].astype('string')

df.head()

   age  salary birth_data  have_job sectors
0   30    1500 1999-01-19         0    <NA>
1   50    7000 1999-01-19         1      rh
2   25    1200 1999-01-19         1      ti
3   40    5000 1999-01-19         1      ml
4   35    3000 1999-01-19         1      ia

In [431]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         12 non-null     int8
 1   salary      12 non-null     int16
 2   birth_data  12 non-null     datetime64[ns]
 3   have_job    12 non-null     int8
 4   sectors     11 non-null     string
dtypes: datetime64[ns](1), int16(1), int8(2), string(1)
memory usage: 372.0 bytes

# Exercise 5

The column `code` is float, but values represent integer IDs.


- Convert this column to integer type.

In [432]:
df.insert(loc=5, column='code', value=3.9)

In [433]:
df['code'] = df['code'].astype(np.int16)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         12 non-null     int8
 1   salary      12 non-null     int16
 2   birth_data  12 non-null     datetime64[ns]
 3   have_job    12 non-null     int8
 4   sectors     11 non-null     string
 5   code        12 non-null     int16
dtypes: datetime64[ns](1), int16(2), int8(2), string(1)
memory usage: 396.0 bytes

# Exercise 6:

The column `active` contains the strings "yes" and "no".

- Convert this column to boolean (True if "yes", False for "no").

In [434]:
df.insert(loc=6, column='active', value='No')

In [435]:
df.loc[df.index[:3], 'active'] = 'Yes'

In [438]:
df['active'] = df['active'].map(lambda x: True if x == 'Yes' else False)


df['active'].dtype

dtype('bool')